[View in Colaboratory](https://colab.research.google.com/gist/zliu8/a2874769b83c6089c418efeb22661c99/sliderule_dsi_json_exercise.ipynb)

# JSON examples and exercise
****
+ get familiar with packages for dealing with JSON
+ study examples with JSON strings and files 
+ work on exercise to be completed and submitted 
****
+ reference: http://pandas.pydata.org/pandas-docs/stable/io.html#io-json-reader
+ data source: http://jsonstudio.com/resources/
****

In [0]:
import pandas as pd

## imports for Python, Pandas

In [0]:
import json
from pandas.io.json import json_normalize

## JSON example, with string

+ demonstrates creation of normalized dataframes (tables) from nested json string
+ source: http://pandas.pydata.org/pandas-docs/stable/io.html#normalization

In [0]:
# define json string
data = [{'state': 'Florida', 
         'shortname': 'FL',
         'info': {'governor': 'Rick Scott'},
         'counties': [{'name': 'Dade', 'population': 12345},
                      {'name': 'Broward', 'population': 40000},
                      {'name': 'Palm Beach', 'population': 60000}]},
        {'state': 'Ohio',
         'shortname': 'OH',
         'info': {'governor': 'John Kasich'},
         'counties': [{'name': 'Summit', 'population': 1234},
                      {'name': 'Cuyahoga', 'population': 1337}]}]

In [4]:
# use normalization to create tables from nested element
json_normalize(data, 'counties')

         name  population
0        Dade       12345
1     Broward       40000
2  Palm Beach       60000
3      Summit        1234
4    Cuyahoga        1337

In [5]:
# further populate tables created from nested element
json_normalize(data, 'counties', ['state', 'shortname', ['info', 'governor']])

         name  population    state shortname info.governor
0        Dade       12345  Florida        FL    Rick Scott
1     Broward       40000  Florida        FL    Rick Scott
2  Palm Beach       60000  Florida        FL    Rick Scott
3      Summit        1234     Ohio        OH   John Kasich
4    Cuyahoga        1337     Ohio        OH   John Kasich

****
## JSON example, with file

+ demonstrates reading in a json file as a string and as a table
+ uses small sample file containing data about projects funded by the World Bank 
+ data source: http://jsonstudio.com/resources/

In [0]:
# load json as string
json.load((open('world_bank_projects_less.json')))

In [10]:
# load as Pandas dataframe
sample_json_df = pd.read_json('world_bank_projects_less.json')
sample_json_df

,_id,approvalfy,board_approval_month,boardapprovaldate,borrower,closingdate,country_namecode,countrycode,countryname,countryshortname,...,sectorcode,source,status,supplementprojectflg,theme1,theme_namecode,themecode,totalamt,totalcommamt,url
0,{'$oid': '52b213b38594d8a2be17c780'},1999,November,2013-11-12T00:00:00Z,FEDERAL DEMOCRATIC REPUBLIC OF ETHIOPIA,2018-07-07T00:00:00Z,Federal Democratic Republic of Ethiopia!$!ET,ET,Federal Democratic Republic of Ethiopia,Ethiopia,...,"ET,BS,ES,EP",IBRD,Active,N,"{'Name': 'Education for all', 'Percent': 100}","[{'name': 'Education for all', 'code': '65'}]",65,130000000,130000000,http://www.worldbank.org/projects/P129828/ethi...
1,{'$oid': '52b213b38594d8a2be17c781'},2015,November,2013-11-04T00:00:00Z,GOVERNMENT OF TUNISIA,NaN,Republic of Tunisia!$!TN,TN,Republic of Tunisia,Tunisia,...,"BZ,BS",IBRD,Active,N,"{'Name': 'Other economic management', 'Percent...","[{'name': 'Other economic management', 'code':...","54,24",0,4700000,http://www.worldbank.org/projects/P144674?lang=en

****
## JSON exercise

Using data in file 'data/world_bank_projects.json' and the techniques demonstrated above,
1. Find the 10 countries with most projects
2. Find the top 10 major project themes (using column 'mjtheme_namecode')
3. In 2. above you will notice that some entries have only the code and the name is missing. Create a dataframe with the missing names filled in.

In [0]:
import pandas as pd

In [0]:
import numpy as np

In [0]:
import json
from pandas.io.json import json_normalize

In [0]:
###load json as string
data=json.load((open('world_bank_projects.json')))

###load json to panda as dataframe
df=pd.read_json('world_bank_projects.json')

In [1]:
################exercise1 find top 10 countries by number of projects
top_projects= df[['countryname' , 'project_name']]
top_projects= top_projects.groupby('countryname')
top_projects= top_projects.size().sort_values(ascending=False)
top_projects = top_projects.head(10)
top_projects

NameError: ignored

In [0]:
################exercise2 "The top 10 major project themes"
####First, normalize the data to create the tables
top_project_themes=json_normalize(data,'mjtheme_namecode')
top_project_themes
####Group by name 
top_project_themes=top_project_themes.groupby('name')
####sort the result
top_project_themes=top_project_themes.size().sort_values(ascending=False)
top_project_themes=top_project_themes.head(10)
top_project_themes

In [0]:
################exercise3 "filling in the missing names"
dataframe= json_normalize(data, 'mjtheme_namecode')
dataframe
data_unique= dataframe.drop_duplicates()
data_unique
####replace the empty space as NA
data_unique = data_unique[data_unique != '']
data_unique.dropna(subset=['name'], inplace=True)
#change 'code' to be an integer
x1 = data_unique[['code']].astype(int)
x2 = data_unique[['name']]
#using concat(), sort using sort_values(), and reset the index
x = pd.concat([x1, x2], axis=1)
x = x.sort_values("code")
x = x.reset_index(drop=True)
x